src/Documents/InventoryTransfer/InventoryTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InventoryTransfer</name>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <attributes>
    <name>WarehouseSender</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseReceiper</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>SendingStaff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceivingStaff</name>
    <type>
      <types>CatalogRef.Staffs</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Note</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/InventoryTransfer/ManagerModule.bsl
Procedure InPhiếuĐiềuChuyểnKho(Spreadsheet, Ref) Export
	//{{_PRINT_WIZARD(InPhiếuĐiềuChuyểnKho)
	Template = Documents.InventoryTransfer.GetTemplate("PrintInventoryTransfer");
	Query = New Query;
	Query.Text =
	"SELECT
	|	InventoryTransfer.Date,
	|	InventoryTransfer.KhoNhập,
	|	InventoryTransfer.WarehouseSender,
	|	InventoryTransfer.ReceivingStaff,
	|	InventoryTransfer.Products.(
	|		LineNumber,
	|		Products,
	|		Unit,
	|		Quantity
	|	)
	|FROM
	|	Document.InventoryTransfer AS InventoryTransfer
	|WHERE
	|	InventoryTransfer.Ref IN (&Ref)";
	Query.Parameters.Insert("Ref", Ref);
	Selection = Query.Execute().Select();

	AreaCaption = Template.GetArea("Caption");
	Header = Template.GetArea("Header");
	AreaBảngMặtHàngHeader = Template.GetArea("BảngMặtHàngHeader");
	AreaBảngMặtHàng = Template.GetArea("Products");
	Footer = Template.GetArea("Footer");

	Spreadsheet.Clear();

	InsertPageBreak = False;
	While Selection.Next() Do
		If InsertPageBreak Then
			Spreadsheet.PutHorizontalPageBreak();
		EndIf;

		Spreadsheet.Put(AreaCaption);

		Header.Parameters.Fill(Selection);
		Spreadsheet.Put(Header, Selection.Level());

		Spreadsheet.Put(AreaBảngMặtHàngHeader);
		SelectionBảngMặtHàng = Selection.BảngMặtHàng.Select();
		While SelectionBảngMặtHàng.Next() Do
			AreaBảngMặtHàng.Parameters.Fill(SelectionBảngMặtHàng);
			Spreadsheet.Put(AreaBảngMặtHàng, SelectionBảngMặtHàng.Level());
		EndDo;

		Footer.Parameters.Fill(Selection);
		Spreadsheet.Put(Footer);

		InsertPageBreak = True;
	EndDo;
	//}}
EndProcedure
